devdnl/dnx-rtos/src/system/drivers/usbh/stm32f4/usbh.c
/*==============================================================================
File    usbh.c

Author  Daniel Zorychta

Brief   USB Host driver

        Copyright (C) 2021  <daniel.zorychta@gmail.com>

        This program is free software; you can redistribute it and/or modify
        it under the terms of the GNU General Public License as published by
        the Free Software Foundation and modified by the dnx RTOS exception.

        NOTE: The modification  to the GPL is  included to allow you to
              distribute a combined work that includes dnx RTOS without
              being obliged to provide the source  code for proprietary
              components outside of the dnx RTOS.

        The dnx RTOS  is  distributed  in the hope  that  it will be useful,
        but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
        MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
        GNU General Public License for more details.

        Full license text is available on the following file: doc/license.txt.

==============================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include <stdalign.h>
#include "drivers/driver.h"
#include "drivers/class/storage/mbr.h"
#include "stm32f4/lib/stm32f4xx_rcc.h"
#include "stm32f4/dma_ddi.h"
#include "../usbh_ioctl.h"
#include "gpio/gpio_ddi.h"

#include "usbh_core.h"
#include "usbh_msc.h"
#include "stm32f4xx_hal_hcd.h"
#include "usbh_msc_scsi.h"

#include "usbh_conf.h"
#include "usbh_core.h"
#include "stm32f4xx.h"

/*==============================================================================
  Local macros
==============================================================================*/
#if __USBH_DEBUG_MSG__
#define DEBUG(...)      printk("USBH: "__VA_ARGS__)
#else
#define DEBUG(...)
#endif

#define _PASTER(x, y)           x##y
#define _EVALUATOR(x, y)        _PASTER(x, y)
#define RESET_PIN_PORT_IDX      _EVALUATOR(IOCTL_GPIO_PORT_IDX__, __USBH_PHY_RESET_PIN__)
#define RESET_PIN_PIN_IDX       _EVALUATOR(IOCTL_GPIO_PIN_IDX__, __USBH_PHY_RESET_PIN__)

#define RECOVERY_TIMEOUT        5000
#define SECTOR_SIZE             512

/*==============================================================================
  Local object types
==============================================================================*/
typedef struct {
        u8_t major;
        u8_t minor;
        kmtx_t *mtx;
        USBH_HandleTypeDef hUSBHost;
        HCD_HandleTypeDef hhcd;
        bool class_active;
        u32_t irq_ctr_max;
        alignas(_HEAP_ALIGN_) u8_t buffer[8 * SECTOR_SIZE];
} USBH_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
static void free_resources(void);
static void USBH_UserProcess(USBH_HandleTypeDef *phost, uint8_t id);
static int recovery_usb_connection(USBH_t *hdl);

/*==============================================================================
  Local object
==============================================================================*/
MODULE_NAME(USBH);
static USBH_t *usbh;

/*==============================================================================
  Exported object
==============================================================================*/
bool  usbh_irq;
u32_t usbh_irq_ctr;
bool  usbh_force_reinit;

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device.
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 * @param[in ]            config               optional module configuration
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_INIT(USBH, void **device_handle, u8_t major, u8_t minor, const void *config)
{
        UNUSED_ARG1(config);

        int err = ENODEV;

        if ((major != 0) || (minor != 0)) {
                return err;
        }

        err = sys_zalloc(sizeof(*usbh), cast(void*, &usbh));
        if (!err) {
                *device_handle = usbh;
                USBH_t *hdl = usbh;

                LL_RCC_ClocksTypeDef freq;
                LL_RCC_GetSystemClocksFreq(&freq);
                usbh->irq_ctr_max = freq.HCLK_Frequency / 1000UL / 32;

                err = sys_mutex_create(KMTX_TYPE_NORMAL, &hdl->mtx);
                if (err) {
                        goto finish;
                }

                err = USBH_Init(&hdl->hUSBHost, USBH_UserProcess, 0);
                if (err) {
                        goto finish;
                }

                err = USBH_RegisterClass(&hdl->hUSBHost, USBH_MSC_CLASS);
                if (err) {
                        goto finish;
                }

                err = USBH_Start(&hdl->hUSBHost);
                if (err) {
                        goto finish;
                }

                finish:
                if (err) {
                        free_resources();
                        return err;
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Release device.
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_RELEASE(USBH, void *device_handle)
{
        free_resources();

        sys_free(&device_handle);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Open device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_OPEN(USBH, void *device_handle, u32_t flags)
{
        UNUSED_ARG2(device_handle, flags);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Close device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_CLOSE(USBH, void *device_handle, bool force)
{
        UNUSED_ARG2(device_handle, force);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Write data to device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *wrcnt                  number of written bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_WRITE(USBH,
              void             *device_handle,
              const u8_t       *src,
              size_t            count,
              fpos_t           *fpos,
              size_t           *wrcnt,
              struct vfs_fattr  fattr)
{
        UNUSED_ARG1(fattr);

        USBH_t *hdl = device_handle;

        if ((count & 0x1FF) || (*fpos & 0x1FF)) {
                return EINVAL;
        }

