devdnl/dnx-rtos/src/system/drivers/usbh/stm32f4/usbh.c
        return err;
}

//==============================================================================
/**
 * @brief IO control.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_IOCTL(USBH, void *device_handle, int request, void *arg)
{
        USBH_t *hdl = device_handle;

        int err = EINVAL;

        switch (request) {
        case IOCTL_USBH__GET_MANUFACTURER_STRING:
                if (arg) {
                        usbh_buf_t *buf = arg;
                        if (buf->ptr && buf->len) {
                                sys_strlcpy(buf->ptr, hdl->hUSBHost.manufacturer_name, buf->len);
                                err = 0;
                        }
                }
                break;

        case IOCTL_USBH__GET_PRODUCT_STRING:
                if (arg) {
                        usbh_buf_t *buf = arg;
                        if (buf->ptr && buf->len) {
                                sys_strlcpy(buf->ptr, hdl->hUSBHost.product_name, buf->len);
                                err = 0;
                        }
                }
                break;

        case IOCTL_USBH__GET_SERIAL_STRING:
                if (arg) {
                        usbh_buf_t *buf = arg;
                        if (buf->ptr && buf->len) {
                                sys_strlcpy(buf->ptr, hdl->hUSBHost.serial_number, buf->len);
                                err = 0;
                        }
                }
                break;

        default:
                err = EBADRQC;
                break;
        }

        return err;
}

//==============================================================================
/**
 * @brief Flush device.
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_FLUSH(USBH, void *device_handle)
{
        UNUSED_ARG1(device_handle);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_STAT(USBH, void *device_handle, struct vfs_dev_stat *device_stat)
{
        USBH_t *hdl = device_handle;

        if (hdl->class_active) {
                MSC_LUNTypeDef info;
                USBH_MSC_GetLUNInfo(&hdl->hUSBHost, 0, &info);
                device_stat->st_size = cast(u64_t, info.capacity.block_nbr)
                                     * info.capacity.block_size;
        }

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Function free all driver resources.
 */
//==============================================================================
static void free_resources(void)
{
        if (usbh) {
                USBH_Stop(&usbh->hUSBHost);
                USBH_DeInit(&usbh->hUSBHost);

                if (usbh->mtx) {
                        sys_mutex_destroy(usbh->mtx);
                }

                sys_free(cast(void*, &usbh));
        }
}

//==============================================================================
/**
 * @brief  Recovery USB device connection (by reenumeration process).
 *
 * @param  hdl          device handle
 *
 * @return One of errno value.
 */
//==============================================================================
static int recovery_usb_connection(USBH_t *hdl)
{
        hdl->class_active = false;

        int err = USBH_ReEnumerate(&hdl->hUSBHost); // start re-enumeration
        if (!err) {
                clock_t tref = sys_get_uptime_ms();

                while (not hdl->class_active) {
                        sys_sleep_ms(100);

                        if (sys_is_time_expired(tref, RECOVERY_TIMEOUT)) {
                                err = EIO;
                                break;
                        }
                }

                if (!err) {
                        printk("USBH: connection recovered");
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief  USB host library user process.
 *
 * @param  phost        USB host handle
 * @param  id           operation id
 */
//==============================================================================
static void USBH_UserProcess(USBH_HandleTypeDef *phost, uint8_t id)
{
        UNUSED_ARG1(phost);

        switch (id) {
        case HOST_USER_SELECT_CONFIGURATION:
                usbh->class_active = false;
                break;

        case HOST_USER_DISCONNECTION:
                usbh->class_active = false;
                memset(usbh->hUSBHost.manufacturer_name, 0, sizeof(usbh->hUSBHost.manufacturer_name));
                memset(usbh->hUSBHost.product_name, 0, sizeof(usbh->hUSBHost.product_name));
                memset(usbh->hUSBHost.serial_number, 0, sizeof(usbh->hUSBHost.serial_number));
                break;

        case HOST_USER_CONNECTION:
                usbh->class_active = false;
                break;

        case HOST_USER_CLASS_ACTIVE:
                usbh->class_active = true;
                break;

        default:
                break;
        }
}

/*******************************************************************************
                       HCD BSP Routines
*******************************************************************************/
//==============================================================================
/**
 * @brief  Initializes the HCD MSP.
 * @param  hhcd: HCD handle
 * @retval None
 */
//==============================================================================
void HAL_HCD_MspInit(HCD_HandleTypeDef *hhcd)
{
        if (hhcd->Instance == USB_OTG_FS) {
                /* Enable USB FS Clocks */
                SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_OTGFSEN);

                /* Set USBFS Interrupt to the lowest priority */
                NVIC_SetPriority(OTG_FS_IRQn, _CPU_IRQ_SAFE_PRIORITY_);

                /* Enable USBFS Interrupt */
                NVIC_EnableIRQ(OTG_FS_IRQn);

        } else if (hhcd->Instance == USB_OTG_HS) {
                /* Enable ULPI clock */
                SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_OTGHSULPIEN);

