devdnl/dnx-rtos/src/system/drivers/usbh/stm32f4/usbh.c
        switch (HAL_HCD_GetCurrentSpeed(phost->pData)) {
        case 0:
                printk("USBH: connected high speed device");
                speed = USBH_SPEED_HIGH;
                break;

        case 1:
                printk("USBH: connected full speed device");
                speed = USBH_SPEED_FULL;
                break;

        case 2:
                printk("USBH: connected low speed device");
                speed = USBH_SPEED_LOW;
                break;

        default:
                printk("USBH: connected full speed device");
                speed = USBH_SPEED_FULL;
                break;
        }

        return speed;
}

//==============================================================================
/**
 * @brief  USBH_LL_ResetPort
 *         Reset the Host Port of the Low Level Driver.
 * @param  phost: Host handle
 * @retval USBH Status
 */
//==============================================================================
USBH_StatusTypeDef USBH_LL_ResetPort(USBH_HandleTypeDef *phost)
{
        _GPIO_DDI_set_pin(RESET_PIN_PORT_IDX, RESET_PIN_PIN_IDX);
        sys_sleep_ms(50);
        _GPIO_DDI_clear_pin(RESET_PIN_PORT_IDX, RESET_PIN_PIN_IDX);

        HAL_HCD_ResetPort(phost->pData);
        return USBH_OK;
}

//==============================================================================
/**
 * @brief  USBH_LL_GetLastXferSize
 *         Return the last transferred packet size.
 * @param  phost: Host handle
 * @param  pipe: Pipe index
 * @retval Packet Size
 */
//==============================================================================
uint32_t USBH_LL_GetLastXferSize(USBH_HandleTypeDef *phost, uint8_t pipe)
{
        return HAL_HCD_HC_GetXferCount(phost->pData, pipe);
}

//==============================================================================
/**
 * @brief  USBH_LL_OpenPipe
 *         Open a pipe of the Low Level Driver.
 * @param  phost: Host handle
 * @param  pipe_num: Pipe index
 * @param  epnum: Endpoint Number
 * @param  dev_address: Device USB address
 * @param  speed: Device Speed
 * @param  ep_type: Endpoint Type
 * @param  mps: Endpoint Max Packet Size
 * @retval USBH Status
 */
//==============================================================================
USBH_StatusTypeDef USBH_LL_OpenPipe(USBH_HandleTypeDef *phost,
                                    uint8_t pipe_num,
                                    uint8_t epnum,
                                    uint8_t dev_address,
                                    uint8_t speed,
                                    uint8_t ep_type,
                                    uint16_t mps)
{
        HAL_HCD_HC_Init(phost->pData,
                        pipe_num,
                        epnum,
                        dev_address,
                        speed,
                        ep_type,
                        mps);
        return USBH_OK;
}

//==============================================================================
/**
 * @brief  USBH_LL_ClosePipe
 *         Close a pipe of the Low Level Driver.
 * @param  phost: Host handle
 * @param  pipe_num: Pipe index
 * @retval USBH Status
 */
//==============================================================================
USBH_StatusTypeDef USBH_LL_ClosePipe(USBH_HandleTypeDef *phost, uint8_t pipe)
{
        HAL_HCD_HC_Halt(phost->pData, pipe);
        return USBH_OK;
}

//==============================================================================
/**
 * @brief  USBH_LL_SubmitURB
 *         Submit a new URB to the low level driver.
 * @param  phost: Host handle
 * @param  pipe: Pipe index
 *         This parameter can be a value from 1 to 15
 * @param  direction : Channel number
 *          This parameter can be one of the these values:
 *           0 : Output
 *           1 : Input
 * @param  ep_type : Endpoint Type
 *          This parameter can be one of the these values:
 *            @arg EP_TYPE_CTRL: Control type
 *            @arg EP_TYPE_ISOC: Isochronous type
 *            @arg EP_TYPE_BULK: Bulk type
 *            @arg EP_TYPE_INTR: Interrupt type
 * @param  token : Endpoint Type
 *          This parameter can be one of the these values:
 *            @arg 0: PID_SETUP
 *            @arg 1: PID_DATA
 * @param  pbuff : pointer to URB data
 * @param  length : Length of URB data
 * @param  do_ping : activate do ping protocol (for high speed only)
 *          This parameter can be one of the these values:
 *           0 : do ping inactive
 *           1 : do ping active
 * @retval Status
 */
//==============================================================================
USBH_StatusTypeDef USBH_LL_SubmitURB(USBH_HandleTypeDef *phost,
                                     uint8_t pipe,
                                     uint8_t direction,
                                     uint8_t ep_type,
                                     uint8_t token,
                                     uint8_t *pbuff,
                                     uint16_t length,
                                     uint8_t do_ping)
{
        HAL_HCD_HC_SubmitRequest(phost->pData,
                                 pipe,
                                 direction,
                                 ep_type,
                                 token,
                                 pbuff,
                                 length,
                                 do_ping);
        return USBH_OK;
}

//==============================================================================
/**
 * @brief  USBH_LL_GetURBState
 *         Get a URB state from the low level driver.
 * @param  phost: Host handle
 * @param  pipe: Pipe index
 *         This parameter can be a value from 1 to 15
 * @retval URB state
 *          This parameter can be one of the these values:
 *            @arg URB_IDLE
 *            @arg URB_DONE
 *            @arg URB_NOTREADY
 *            @arg URB_NYET
 *            @arg URB_ERROR
 *            @arg URB_STALL
 */
//==============================================================================
USBH_URBStateTypeDef USBH_LL_GetURBState(USBH_HandleTypeDef *phost, uint8_t pipe)
{
        return (USBH_URBStateTypeDef)HAL_HCD_HC_GetURBState (phost->pData, pipe);
}

//==============================================================================
/**
 * @brief  USBH_LL_DriverVBUS
 *         Drive VBUS.
 * @param  phost: Host handle
 * @param  state : VBUS state
 *          This parameter can be one of the these values:
 *           0 : VBUS Active
 *           1 : VBUS Inactive
 * @retval Status
 */
//==============================================================================
USBH_StatusTypeDef USBH_LL_DriverVBUS(USBH_HandleTypeDef *phost, uint8_t state)
{
        UNUSED_ARG2(phost, state);

#ifdef USE_USB_FS
        if(state == 0) {
                /* Configure Low Charge pump */
                BSP_IO_WritePin(OTG_FS1_POWER_SWITCH_PIN, BSP_IO_PIN_RESET);
        } else {
                /* Drive High Charge pump */
                BSP_IO_WritePin(OTG_FS1_POWER_SWITCH_PIN, BSP_IO_PIN_SET);
        }
#endif
        sys_sleep_ms(200);

        return USBH_OK;
}

//==============================================================================
/**
 * @brief  USBH_LL_SetToggle
 *         Set toggle for a pipe.
 * @param  phost: Host handle
 * @param  pipe: Pipe index
 * @param  pipe_num: Pipe index
 * @param  toggle: toggle (0/1)
 * @retval Status
 */
//==============================================================================
USBH_StatusTypeDef USBH_LL_SetToggle(USBH_HandleTypeDef *phost, uint8_t pipe, uint8_t toggle)
{
        UNUSED_ARG1(phost);

        USBH_t *hdl = usbh;

